In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('/content/drive/MyDrive/Estudos/Banco Carrefour/datasets/Gapminder.csv', sep=';')

In [3]:
# Verificando o DataFrame, as 5 primeiras linhas
df.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [7]:
# Alterando os nomes da colunas do DataFrame
df = df.rename(columns={'country':'pais', 'continent':'continente', 'year':'ano', 'lifeExp':'expectatica_de_vida', 'pop':'populacao_total', 'gdpPercap':'pib'})

In [8]:
df.head()

          pais continente  ...  populacao_total         pib
0  Afghanistan       Asia  ...          8425333  779.445314
1  Afghanistan       Asia  ...          9240934  820.853030
2  Afghanistan       Asia  ...         10267083  853.100710
3  Afghanistan       Asia  ...         11537966  836.197138
4  Afghanistan       Asia  ...         13079460  739.981106

[5 rows x 6 columns]

In [9]:
# Total de linhas e colunas
df.shape

(3312, 6)

In [10]:
df.columns

Index(['pais', 'continente', 'ano', 'expectatica_de_vida', 'populacao_total',
       'pib'],
      dtype='object')

In [11]:
df.dtypes

pais                    object
continente              object
ano                      int64
expectatica_de_vida    float64
populacao_total          int64
pib                    float64
dtype: object

In [17]:
df.describe()

               ano  expectatica_de_vida  populacao_total            pib
count  3312.000000          3312.000000     3.312000e+03    3312.000000
mean   1980.301630            65.246871     3.161489e+07   11317.115805
std      16.927294            11.768412     1.041193e+08   11369.142739
min    1950.000000            23.599000     5.941200e+04     241.165877
25%    1967.000000            58.337500     2.678572e+06    2514.625266
50%    1982.000000            69.610000     7.557218e+06    7838.505123
75%    1996.000000            73.657750     1.958522e+07   17357.879170
max    2007.000000            82.670000     1.318683e+09  113523.132900

In [18]:
df.continente.unique()

array(['Asia', 'Europe', 'Africa', 'Americas', nan, 'FSU', 'Oceania'],
      dtype=object)

In [20]:
Oceania = df.loc[df['continente'] == 'Oceania']

In [21]:
Oceania.head()

     pais continente   ano  expectatica_de_vida  populacao_total          pib
975  Fiji    Oceania  1962               56.494           421869  2039.393277
976  Fiji    Oceania  1967               58.607           485000  2170.073285
977  Fiji    Oceania  1972               60.642           544000  2797.759484
978  Fiji    Oceania  1977               62.669           599339  3182.569600
979  Fiji    Oceania  1982               64.683           658906  3209.257468

In [22]:
df.groupby('continente')['pais'].nunique()

continente
Africa      51
Americas    25
Asia        41
Europe      35
FSU          6
Oceania      3
Name: pais, dtype: int64

In [23]:
df.groupby('ano')['expectatica_de_vida'].mean()

ano
1950    62.002568
1951    65.904167
1952    49.206867
1953    66.674563
1954    67.459817
1955    67.806757
1956    67.950637
1957    51.614590
1958    68.815936
1959    68.226579
1960    68.470837
1961    68.862480
1962    54.035234
1963    69.595735
1964    70.063105
1965    70.259881
1966    70.447526
1967    56.263629
1968    70.689081
1969    70.653896
1970    70.961141
1971    71.103976
1972    58.474481
1973    71.500338
1974    71.778504
1975    71.939218
1976    72.158050
1977    60.429090
1978    72.717567
1979    73.018717
1980    73.064524
1981    73.337399
1982    62.365871
1983    73.787778
1984    74.100741
1985    74.112222
1986    74.452222
1987    63.984860
1988    74.760000
1989    74.924444
1990    74.283437
1991    74.374848
1992    65.008443
1993    74.324545
1994    74.456667
1995    74.552727
1996    75.029394
1997    65.873799
1998    75.569697
1999    75.703636
2000    76.026364
2001    76.257879
2002    66.835695
2003    76.586667
2004    76.921563
2005    76.718667
2006    77.887778
2007    67.868557
Name: expectatica_de_vida, dtype: float64

In [24]:
df['pib'].mean()

11317.115804696637

In [25]:
df['pib'].sum()

37482287.5451553

### Trabalhando com planilhas no Excel

In [26]:
d1 = pd.read_excel('/content/drive/MyDrive/Estudos/Banco Carrefour/datasets/Aracaju.xlsx')

In [27]:
d2 = pd.read_excel('/content/drive/MyDrive/Estudos/Banco Carrefour/datasets/Fortaleza.xlsx')

In [28]:
d3 = pd.read_excel('/content/drive/MyDrive/Estudos/Banco Carrefour/datasets/Natal.xlsx')

In [29]:
d4 = pd.read_excel('/content/drive/MyDrive/Estudos/Banco Carrefour/datasets/Recife.xlsx')

In [30]:
d5 = pd.read_excel('/content/drive/MyDrive/Estudos/Banco Carrefour/datasets/Salvador.xlsx')

In [31]:
d1.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [32]:
d2.head()

      Cidade       Data  Vendas  LojaID  Qtde
0  Fortaleza 2019-01-01   45.27    1002     2
1  Fortaleza 2019-01-01  115.61    1002     3
2  Fortaleza 2019-02-10   35.33    1004     3
3  Fortaleza 2019-02-10   20.95    1004     6
4  Fortaleza 2019-01-01   14.25    1004     6

In [33]:
d3.head()

  Cidade       Data  Vendas  LojaID  Qtde
0  Natal 2018-08-27   606.0     853     2
1  Natal 2018-11-25   563.0     853     2
2  Natal 2019-03-11   308.0     852     3
3  Natal 2019-01-07   271.0     854     3
4  Natal 2019-03-09   699.0     853     3

In [34]:
d4.head()

   Cidade       Data  Vendas  LojaID  Qtde
0  Recife 2019-01-01  162.61     981     1
1  Recife 2019-01-01   11.44     983     1
2  Recife 2019-02-10   12.94     983     5
3  Recife 2019-02-10  160.54     981     3
4  Recife 2019-02-14   19.89     983     7

In [36]:
d5.head()

     Cidade       Data  Vendas  LojaID  Qtde
0  Salvador 2018-01-01   31.06    1037     3
1  Salvador 2018-01-01   19.02    1034     3
2  Salvador 2019-02-10  173.59    1035     3
3  Salvador 2019-02-10  176.34    1037     3
4  Salvador 2019-02-14   19.47    1037     3

In [38]:
df = pd.concat([d1, d2, d3, d4, d5])

In [39]:
df.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [40]:
df.tail()

       Cidade       Data  Vendas  LojaID  Qtde
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

In [41]:
df.sample(5)

        Cidade       Data  Vendas  LojaID  Qtde
122     Recife 2019-03-02  235.06     983     3
71   Fortaleza 2019-01-01   41.89    1004     4
41     Aracaju 2018-01-01  229.64    1520     8
51       Natal 2018-01-21  859.00     852     4
51     Aracaju 2018-01-01   40.58    1522     6

In [42]:
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64